use rand::RngCore;
// Generate random byte using OS RNG
pub fn random_bytes(n: usize) -> Vec<u8> {
    let mut  v = vec![0u8; n];
    let mut rng = rand::rngs::OsRng;
    rng.fill_bytes(&mut v);
    v
}

pub fn print_type<T>(_: &T) {
    println!("{}", std::any::type_name::<T>());
}

pub fn hex_color_to_bytes(hex: &str) -> Vec<u8> {
    let hex = hex.trim_start_matches('#');
    if hex.len() != 6 {
        panic!("Invalid HEX color length");
    }
    
    let r = u8::from_str_radix(&hex[0..2], 16).unwrap();
    let g = u8::from_str_radix(&hex[2..4], 16).unwrap();
    let b = u8::from_str_radix(&hex[4..6], 16).unwrap();
    
    vec![r, g, b]
}

pub const EMOJI_LIST: [&str; 140] = [
    "😀", "😃", "😄", "😁", "😆", "😅", "😂", "🤣", "😊", "😇", 
    "🙂", "🙃", "😉", "😌", "😍", "🥰", "😘", "😗", "😙", "😚",
    "😋", "😛", "😝", "😜", "🤪", "🤨", "🧐", "🤓", "😎", "🤩",
    "🥳", "😏", "😒", "😞", "😔", "😟", "😕", "🙁", "☹️", "😣",
    "😖", "😫", "😩", "🥺", "😢", "😭", "😤", "😠", "😡", "🤬",
    "🤯", "😳", "🥵", "🥶", "😱", "😨", "😰", "😥", "😓", "🤗",
    "🤔", "🤭", "🤫", "🤥", "😶", "😐", "😑", "😬", "🙄", "😯",
    "😦", "😧", "😮", "😲", "🥱", "😴", "🤤", "😪", "😵", "🤐",
    "🥴", "🤢", "🤮", "🤧", "😷", "🤒", "🤕", "🤑", "🤠", "😈",
    "👿", "👹", "👺", "🤡", "💩", "👻", "💀", "☠️", "👽", "👾",
    "🤖", "🎃", "😺", "😸", "😹", "😻", "😼", "😽", "🙀", "😿",
    "😾", "👋", "🤚", "🖐️", "✋", "🖖", "👌", "🤏", "✌️", "🤞",
    "🤟", "🤘", "🤙", "👈", "👉", "👆", "🖕", "👇", "☝️", "👍",
    "👎", "✊", "👊", "🤛", "🤜", "👏", "🙌", "👐", "🤲", "🤝"
];

pub fn print_banner(){
    println!(r"  _____                 _              __          __   _ _      _    ");
    println!(r" / ____|               | |             \ \        / /  | | |    | |   ");
    println!(r"| (___  _ __   ___  ___| |_ _ __ __ _   \ \  /\  / /_ _| | | ___| |_  ");
    println!(r" \___ \| '_ \ / _ \/ __| __| '__/ _` |   \ \/  \/ / _` | | |/ _ \ __|");
    println!(r" ____) | |_) |  __/ (__| |_| | | (_| |    \  /\  / (_| | | |  __/ |_ ");
    println!(r"|_____/| .__/ \___|\___|\__|_|  \__,_|     \/  \/ \__,_|_|_|\___|\__|");
    println!(r"       | |                                                           ");
    println!(r"       |_|                                                           ");
    println!("\n")   
}